/* 12. Напишите программу, которая будет принимать на
вход два числа и выводить, является ли первое число
кратным второму. Если число 1 не кратно числу 2, то
программа выводит остаток от деления.
34, 5 -> не кратно, остаток 4
16, 4 -> кратно */
//Все методы должны быть по порядку ВВЕРХУ или ВНИЗУ. Все.

int MultipleNums(int num1, int num2)
{
    return num1 % num2;
}

Console.WriteLine("Введите два числа: ");
int numberFirst = Convert.ToInt32(Console.ReadLine());
int numberSecond = Convert.ToInt32(Console.ReadLine());

int remains = MultipleNums(numberFirst, numberSecond);

if(remains == 0)
{
    Console.WriteLine("Кратно");
}
else 
{
    Console.WriteLine($"Не кратно, {remains}");
}